GigaDevice-GD32-MCU/GD32A10x_Firmware_Library/Firmware/GD32A10x_standard_peripheral/Include/gd32a10x_usart.h
/*!
    \file    gd32a10x_usart.h
    \brief   definitions for the USART
    
    \version 2026-01-30, V1.4.0, firmware for GD32A10x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A10X_USART_H
#define GD32A10X_USART_H

#include "gd32a10x.h"

/* USARTx(x=0,1,2)/UARTx(x=3,4) definitions */
#define USART1                        USART_BASE                     /*!< USART1 base address */
#define USART2                        (USART_BASE+0x00000400U)       /*!< USART2 base address */
#define UART3                         (USART_BASE+0x00000800U)       /*!< UART3 base address */
#define UART4                         (USART_BASE+0x00000C00U)       /*!< UART4 base address */
#define USART0                        (USART_BASE+0x0000F400U)       /*!< USART0 base address */

/* registers definitions */
#define USART_STAT0(usartx)           REG32((usartx) + 0x00000000U)  /*!< USART status register 0 */
#define USART_DATA(usartx)            REG32((usartx) + 0x00000004U)  /*!< USART data register */
#define USART_BAUD(usartx)            REG32((usartx) + 0x00000008U)  /*!< USART baud rate register */
#define USART_CTL0(usartx)            REG32((usartx) + 0x0000000CU)  /*!< USART control register 0 */
#define USART_CTL1(usartx)            REG32((usartx) + 0x00000010U)  /*!< USART control register 1 */
#define USART_CTL2(usartx)            REG32((usartx) + 0x00000014U)  /*!< USART control register 2 */
#define USART_GP(usartx)              REG32((usartx) + 0x00000018U)  /*!< USART guard time and prescaler register */
#define USART_CTL3(usartx)            REG32((usartx) + 0x00000080U)  /*!< USART control register 3 */
#define USART_RT(usartx)              REG32((usartx) + 0x00000084U)  /*!< USART receiver timeout register */
#define USART_STAT1(usartx)           REG32((usartx) + 0x00000088U)  /*!< USART status register 1 */
#define USART_CHC(usartx)             REG32((usartx) + 0x000000C0U)  /*!< USART coherence control register */

/* bits definitions */
/* USARTx_STAT0 */
#define USART_STAT0_PERR              BIT(0)                         /*!< parity error flag */
#define USART_STAT0_FERR              BIT(1)                         /*!< frame error flag */
#define USART_STAT0_NERR              BIT(2)                         /*!< noise error flag */
#define USART_STAT0_ORERR             BIT(3)                         /*!< overrun error */
#define USART_STAT0_IDLEF             BIT(4)                         /*!< IDLE frame detected flag */
#define USART_STAT0_RBNE              BIT(5)                         /*!< read data buffer not empty */
#define USART_STAT0_TC                BIT(6)                         /*!< transmission complete */
#define USART_STAT0_TBE               BIT(7)                         /*!< transmit data buffer empty */
#define USART_STAT0_LBDF              BIT(8)                         /*!< LIN break detected flag */
#define USART_STAT0_CTSF              BIT(9)                         /*!< CTS change flag */

/* USARTx_DATA */
#define USART_DATA_DATA               BITS(0,8)                      /*!< transmit or read data value */

/* USARTx_BAUD */
#define USART_BAUD_FRADIV             BITS(0,3)                      /*!< fraction part of baud-rate divider */
#define USART_BAUD_INTDIV             BITS(4,15)                     /*!< integer part of baud-rate divider */

/* USARTx_CTL0 */
#define USART_CTL0_SBKCMD             BIT(0)                         /*!< send break command */
#define USART_CTL0_RWU                BIT(1)                         /*!< receiver wakeup from mute mode */
#define USART_CTL0_REN                BIT(2)                         /*!< enable receiver */
#define USART_CTL0_TEN                BIT(3)                         /*!< enable transmitter */
#define USART_CTL0_IDLEIE             BIT(4)                         /*!< enable idle line detected interrupt */
#define USART_CTL0_RBNEIE             BIT(5)                         /*!< enable read data buffer not empty interrupt and overrun error interrupt */
#define USART_CTL0_TCIE               BIT(6)                         /*!< enable transmission complete interrupt */
#define USART_CTL0_TBEIE              BIT(7)                         /*!< enable transmitter buffer empty interrupt */
#define USART_CTL0_PERRIE             BIT(8)                         /*!< enable parity error interrupt */
#define USART_CTL0_PM                 BIT(9)                         /*!< parity mode */
#define USART_CTL0_PCEN               BIT(10)                        /*!< enable parity check function */
#define USART_CTL0_WM                 BIT(11)                        /*!< wakeup method in mute mode */
#define USART_CTL0_WL                 BIT(12)                        /*!< word length */
#define USART_CTL0_UEN                BIT(13)                        /*!< enable USART */

/* USARTx_CTL1 */
#define USART_CTL1_ADDR               BITS(0,3)                      /*!< address of USART */
#define USART_CTL1_LBLEN              BIT(5)                         /*!< LIN break frame length */
#define USART_CTL1_LBDIE              BIT(6)                         /*!< eanble LIN break detected interrupt */
#define USART_CTL1_CLEN               BIT(8)                         /*!< CK length */
#define USART_CTL1_CPH                BIT(9)                         /*!< CK phase */
#define USART_CTL1_CPL                BIT(10)                        /*!< CK polarity */
#define USART_CTL1_CKEN               BIT(11)                        /*!< enable CK pin */
#define USART_CTL1_STB                BITS(12,13)                    /*!< STOP bits length */
#define USART_CTL1_LMEN               BIT(14)                        /*!< enable LIN mode */

/* USARTx_CTL2 */
#define USART_CTL2_ERRIE              BIT(0)                         /*!< enable error interrupt */
#define USART_CTL2_IREN               BIT(1)                         /*!< enable IrDA mode */
#define USART_CTL2_IRLP               BIT(2)                         /*!< IrDA low-power */
#define USART_CTL2_HDEN               BIT(3)                         /*!< enable half-duplex */
#define USART_CTL2_NKEN               BIT(4)                         /*!< mode NACK enable in smartcard */
#define USART_CTL2_SCEN               BIT(5)                         /*!< senable martcard mode */
#define USART_CTL2_DENR               BIT(6)                         /*!< enable DMA request for reception */
#define USART_CTL2_DENT               BIT(7)                         /*!< enable DMA request for transmission */
#define USART_CTL2_RTSEN              BIT(8)                         /*!< enable RTS */
#define USART_CTL2_CTSEN              BIT(9)                         /*!< enable CTS */
#define USART_CTL2_CTSIE              BIT(10)                        /*!< enable CTS interrupt */

/* USARTx_GP */
#define USART_GP_PSC                  BITS(0,7)                      /*!< prescaler value for dividing the system clock */
#define USART_GP_GUAT                 BITS(8,15)                     /*!< guard time value in smartcard mode */

/* USARTx_CTL3 */
#define USART_CTL3_RTEN               BIT(0)                         /*!< enable receiver timeout */
#define USART_CTL3_SCRTNUM            BITS(1,3)                      /*!< smartcard auto-retry number */
#define USART_CTL3_RTIE               BIT(4)                         /*!< interrupt enable bit of receive timeout event */
#define USART_CTL3_EBIE               BIT(5)                         /*!< interrupt enable bit of end of block event */
#define USART_CTL3_RINV               BIT(8)                         /*!< RX pin level inversion */
#define USART_CTL3_TINV               BIT(9)                         /*!< TX pin level inversion */
#define USART_CTL3_DINV               BIT(10)                        /*!< data bit level inversion */
#define USART_CTL3_MSBF               BIT(11)                        /*!< most significant bit first */

